In [16]:
# Import Libraries

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [20]:
pd.set_option('display.max_columns',None)
pd.set_option('display.max_rows',100)

In [17]:
# Load Data

df = pd.read_csv('Data/gsearch_jobs.csv')

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26966 entries, 0 to 26965
Data columns (total 27 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           26966 non-null  int64
 1   index                26966 non-null  int64
 2   title                26966 non-null  object
 3   company_name         26966 non-null  object
 4   location             26947 non-null  object
 5   via                  26957 non-null  object
 6   description          26966 non-null  object
 7   extensions           26966 non-null  object
 8   job_id               26966 non-null  object
 9   thumbnail            14435 non-null  object
 10  posted_at            26966 non-null  object
 11  schedule_type        26792 non-null  object
 12  work_from_home       11843 non-null  object
 13  salary               4934 non-null   object
 14  search_term          26966 non-null  object
 15  date_time            26966 non-null  object
 16  search_location      26966 non-null  object
 17  commute_time         0 non-null      float64
 18  salary_pay           4934 non-null   object
 19  salary_rate          4934 non-null   object
 20  salary_avg           4934 non-null   float64
 21  salary_min           4639 non-null   float64
 22  salary_max           4639 non-null   float64
 23  salary_hourly        3056 non-null   float64
 24  salary_yearly        1869 non-null   float64
 25  salary_standardized  4934 non-null   float64
 26  description_tokens   26966 non-null  object
dtypes: float64(7), int64(2), object(18)
memory usage: 5.6+ MB

In [22]:
df.head()

,Unnamed: 0,index,title,company_name,location,via,description,extensions,job_id,thumbnail,posted_at,schedule_type,work_from_home,salary,search_term,date_time,search_location,commute_time,salary_pay,salary_rate,salary_avg,salary_min,salary_max,salary_hourly,salary_yearly,salary_standardized,description_tokens
0,0,0,Data Analyst - Remote! ($64663.00 - $96994.00 ...,Talentify.io,Anywhere,via LinkedIn,Employer is seeking a Data Analyst to join our...,"['17 hours ago', 'Work from home', 'Full-time'...",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLSBSZW1vdG...,https://encrypted-tbn0.gstatic.com/images?q=tb...,17 hours ago,Full-time,True,NaN,data analyst,2023-08-18 03:00:13.822887,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['java', 'git', 'r', 'sas', 'excel', 'python',..."
1,1,1,Data Analyst - 7010605,State of Missouri,"Jefferson City, MO",via Indeed,"Salary: $2,132.85 - $2,175.50 semi-monthly * s...","['11 hours ago', '51,188.40–52,200.00 a year',...",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QgLSA3MDEwNj...,NaN,11 hours ago,Full-time,NaN,"51,188.40–52,200.00 a year",data analyst,2023-08-18 03:00:13.822887,United States,NaN,51188.40–52200.00,a year,51694.2,51188.4,52200.0,NaN,51694.2,51694.2,['tableau']
2,2,2,SQL Data Analyst (Remote),Futura Healthcare,Anywhere,via Built In,A Healthcare SQL Data Analyst is a professiona...,"['20 hours ago', 'Work from home', 'Full-time'...",eyJqb2JfdGl0bGUiOiJTUUwgRGF0YSBBbmFseXN0IChSZW...,https://encrypted-tbn0.gstatic.com/images?q=tb...,20 hours ago,Full-time,True,NaN,data analyst,2023-08-18 03:00:13.822887,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,['sql']
3,3,3,Data Analyst,ATC,United States,via LinkedIn,Job Title: Entry Level Business Analyst / Prod...,"['13 hours ago', 'Full-time', 'Health insurance']",eyJqb2JfdGl0bGUiOiJEYXRhIEFuYWx5c3QiLCJodGlkb2...,https://encrypted-tbn0.gstatic.com/images?q=tb...,13 hours ago,Full-time,NaN,NaN,data analyst,2023-08-18 03:00:13.822887,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,[]
4,4,4,Senior Data Analyst (Remote),The Home Depot,United States,via NRF Job Board - National Retail Federation,Position Purpose:\n\nThe Senior Data Analyst w...,"['20 hours ago', 'Full-time']",eyJqb2JfdGl0bGUiOiJTZW5pb3IgRGF0YSBBbmFseXN0IC...,https://encrypted-tbn0.gstatic.com/images?q=tb...,20 hours ago,Full-time,NaN,NaN,data analyst,2023-08-18 03:00:13.822887,United States,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,"['ssrs', 'asp.net', 'c', 'sql']"